namespace Lario_and_Muigi_Pipe_Problem
{
        /*Вопрос
    Похоже, какой-то хулиган-сантехник и его брат снова бегали вокруг и портили ваши сцены.

    Трубы, соединяющие ступени вашего уровня, необходимо починить, прежде чем вы получите еще какие-либо жалобы.

    Трубы указаны правильно, если каждая труба после первой на 1 больше предыдущей.

    Задача
    Учитывая список уникальных чисел, отсортированных в порядке возрастания, верните новый список таким образом,
    чтобы значения увеличивались на 1 для каждого индекса от минимального значения до максимального значения (оба включены).*/
    internal class Program
    {
        static void Main(string[] args)
        {
           
        }
    }
}